local function run(msg)
if msg.text == "helpfe" then
	return "".. [[ 
Commands Bumper list :
!kick [username|id]
شما همچنین می توانید آن را با پاسخ انجام
〰〰〰〰〰〰
!ban [ username|id]
شما همچنین می توانید آن را با پاسخ انجام
〰〰〰〰〰〰
!unban [id]
شما همچنین می توانید آن را با پاسخ انجام
〰〰〰〰〰〰
!who
فهرست کاربران
〰〰〰〰〰〰
!modlist
لیست مدیران
〰〰〰〰〰〰
!promote [username]
ترویج کسی
〰〰〰〰〰〰
!demote [username]
تنزل مقام کسی
〰〰〰〰〰〰
!kickme
خواهد کاربران پا زدن
〰〰〰〰〰〰
!about
توضیحات گروه
〰〰〰〰〰〰
!setphoto
تنظیم و قفل عکس گروه
〰〰〰〰〰〰
!setname [name]
مجموعه ای نام گروه
〰〰〰〰〰〰
!rules
قوانین گروه
〰〰〰〰〰〰
!id
بازگشت شناسه گروه و یا شناسه کاربر
〰〰〰〰〰〰
!help !helpfa !helpar
این متن به کمک
〰〰〰〰〰〰
!lock [member|name|bots|leave|arabic|tag|adds]  
قفل [عضو | نام | رباتها | leaveing ​​| عربی | تگ | اضافه می کند]
〰〰〰〰〰〰
!unlock [member|name|bots|leave|arabic|tag|adds]
باز [عضو | نام | رباتها | ترک | عربی | تگ | اضافه می کند]
〰〰〰〰〰〰
!set rules <text>
تنظیم <متن> به عنوان قوانین
〰〰〰〰〰〰
!set about <text>
تنظیم <متن> به عنوان مورد
〰〰〰〰〰〰
!settings
گرداند تنظیمات گروه
〰〰〰〰〰〰
!newlink
ایجاد / لغو لینک گروه خود را
〰〰〰〰〰〰
!link
لینک گروه گرداند
〰〰〰〰〰〰
!owner
گرداند شناسه گروه صاحب
〰〰〰〰〰〰
!setowner [id]
خواهد شناسه به عنوان مالک مجموعه
〰〰〰〰〰〰
!setflood [value]
مجموعه ای [ارزش] حساسیت سیل
〰〰〰〰〰〰
!stats
آمار پیام ساده
〰〰〰〰〰〰
!save [value] <text>
ذخیره <متن> به عنوان [ارزش]
〰〰〰〰〰〰
!get [value]
بازده متن [ارزش]
〰〰〰〰〰〰
!clean [modlist|rules|about]
خواهد رفت [لیست وزارت دفاع | قوانین | درباره] و آن را به صفر
〰〰〰〰〰〰
!info [username]
شما یک آمار کاربر
〰〰〰〰〰〰
!public [yes|no]
اجازه می دهد تا کاربر را ببینید | پیوستن به گروه خود را با
!chats
در PV ربات
〰〰〰〰〰〰
!log

خواهد گروه سیاهههای مربوط بازگشت
〰〰〰〰〰〰
!sticker [warn|kick|ok]
هشدار: ارسال هشدار در صورت ارسال برچسب
پا زدن: کاربران ضربه اگر ارسال برچسب
خوب: هیچ چیز اگر ارسال برچسب
〰〰〰〰〰〰
!Bumper
برای شما ارسال Bumper آرم به عنوان برچسب
〰〰〰〰〰〰
!all
دیدن همه چیز در مورد گروه
〰〰〰〰〰〰
!block (user-id)
!unblock (user-id)
بلوک و یا در کاربران (کد: sudo تنها)
〰〰〰〰〰〰
!kickinactive
پا زدن کاربران غیر فعال از گروه
〰〰〰〰〰〰
!pv [user-id] [text]
ارسال متن به کاربر شناسه (کد: sudo تنها)
〰〰〰〰〰〰
!linkpv
ارسال لینک به کامپیوتر شما (برای اولین تلاش شما ارسال 10 اس ام اس به ربات)
〰〰〰〰〰〰
!banlist
خواهد گروه لیست ممنوعیت بازگشت
〰〰〰〰〰〰
!pv pg
ارسال PV شما دستورات
〰〰〰〰〰〰
!welcome [group|pm|disable]
مجموعه ای به گروه خوش آمدید
مجموعه ای خوش آمدید به PM (PV)
مجموعه غیر فعال کردن خوش آمدید
〰〰〰〰〰〰
** U می توانید استفاده کنید "/" و "!" و "."
〰〰〰〰〰〰
* فقط مالک و مدها می توانید رباتها در گروه اضافه کنید
〰〰〰〰〰〰
* فقط مدیران و مالک می تواند ضربه ، ممنوعیت، رفع ممنوعیت ، newlink ، لینک، setphoto ، setname ، قفل ، باز کردن، قوانین مجموعه، مجموعه ای در مورد و دستورات تنظیمات استفاده کنید
〰〰〰〰〰〰
* فقط مالک می تواند با وضوح استفاده کنید، setowner ، ترویج، تنزل رتبه و ورود دستورات
  ]]
  end
end

return {
  description = "helpfe", 
  usage = "/helpfe : helpyou",
  patterns = {
    "^[!/*#.i]helpfe$"
    "^helpfe$"
  }, 
	run = run,
    privileged = true,
	pre_process = pre_process
}
