local function run(msg)
if msg.text == "helpar" then
	return "".. [[ 
أوامر القائمة:

!kick [اسم المستخدم | ID]
يمكنك أيضا القيام بذلك عن طريق الرد
〰〰〰〰〰〰
!ban [اسم المستخدم | ID]
يمكنك أيضا القيام بذلك عن طريق الرد
〰〰〰〰〰〰
!unban [ID]
يمكنك أيضا القيام بذلك عن طريق الرد
〰〰〰〰〰
!who
قائمة الأعضاء
〰〰〰〰〰〰
!modlist
قائمة المشرفين
〰〰〰〰〰〰
!promote [اسم المستخدم]
تشجيع شخص
〰〰〰〰〰〰
!demote [اسم المستخدم]
تخفيض شخص
〰〰〰〰〰〰
!kickme
ستبدأ المستخدم
〰〰〰〰〰〰
!about
وصف المجموعة
〰〰〰〰〰〰
!setphoto
مجموعة والأقفال صورة جماعية
〰〰〰〰〰〰
!setname [اسم]
مجموعة اسم المجموعة
〰〰〰〰〰〰
!rules
قواعد المجموعة
〰〰〰〰〰〰
!id
العودة هوية المجموعة أو هوية المستخدم
〰〰〰〰〰〰
!help
هذا النص المساعدة
〰〰〰〰〰〰
!lock [member|name|bots|leave|tag|adds]
أقفال [عضو | الاسم | البوتات | leaveing ​​| العربية | علامة | يضيف]
〰〰〰〰〰〰
!unlock [member|name|bots|leave|tag|adds]
فتح القفل [عضو | الاسم | البوتات | leaveing ​​| العربية | علامة | يضيف]
〰〰〰〰〰〰
!set rules <النص>
تعيين <النص> كقواعد
〰〰〰〰〰〰
!set about <النص>
تعيين <النص> كما حول
〰〰〰〰〰〰
!settings
يعود ضبط مجموعة
〰〰〰〰〰〰
!newlink
إنشاء / إلغاء ارتباط مجموعتك
〰〰〰〰〰〰
!link
يعود ارتباط مجموعة
〰〰〰〰〰〰
!owner
يعود مالك المجموعة معرف
〰〰〰〰〰〰
!setowner [Id]
سيتم تعيين معرف كمالك
〰〰〰〰〰〰
!setflood [قيمة]
ضبط [قيمة] كما حساسية الفيضانات
〰〰〰〰〰〰
!stats
إحصائيات رسالة بسيطة
〰〰〰〰〰〰
!save [value] <النص>
حفظ <النص> كما [قيمة]
〰〰〰〰〰〰
!get [قيمة]
عوائد نص [قيمة]
〰〰〰〰〰〰
!clean [modlist|rules|about]
سوف مسح [modlist | قواعد | حول] وتعيينها إلى لا شيء
〰〰〰〰〰〰
!info [اسم المستخدم]
نرسل لك احصائيات المستخدم
〰〰〰〰〰〰
!public [yes|no]
السماح لمستخدم رؤية | الانضمام مجموعتك مع
! دردشات
في بوت الكهروضوئية
〰〰〰〰〰〰
!log
سيعود سجلات مجموعة
〰〰〰〰〰〰
!sticker [warn|kick|ok]
تحذير: إرسال تحذير إذا ترسل ملصقا
ركلة: ركلة المستخدم إذا ترسل ملصقا
طيب: لا تفعل شيئا إذا ترسل ملصقا
〰〰〰〰〰〰
!tagall [النص]
المستخدمين العلامة && ترسل رسالتك
〰〰〰〰〰〰
Bumper
نرسل لك Bumper الشعار كما ملصقا
〰〰〰〰〰〰
!all
ترى كل شيء عن الفريق
〰〰〰〰〰〰
!block (مستخدم معرف)
!unblock (مستخدم معرف)
كتلة أو الغاء الحظر عن الاعضاء (سودو فقط)
〰〰〰〰〰〰
!kickinactive
ركلة المستخدمين غير نشط من المجموعة
〰〰〰〰〰〰
!qr [النص]
إنشاء رمز الاستجابة السريعة مع [النص] النص
〰〰〰〰〰〰
!webshot [رابط]
إنشاء wabshot من [URL]
〰〰〰〰〰〰
!pv [user-id] [text]
إرسال رسائل نصية إلى مستخدم معرف (سودو فقط)
〰〰〰〰〰〰
!linkpv
إرسال رابط لالكهروضوئية (على المحاولة الأولى التي ترسلها 10 جي اس للبوت)
〰〰〰〰〰〰
!banlist
سيعود الفريق قائمة الممنوعين
〰〰〰〰〰〰
!pv pg
إرسال الكهروضوئية لك الأوامر
〰〰〰〰〰〰
!welcome [group|pm|disable]
ضبط مرحبا بكم في مجموعة
مجموعة مرحبا بكم في مساء (الكهروضوئية)
تعيين موضع ترحيب تعطيل
〰〰〰〰〰〰
** U يمكن استخدام "/" و "!" و"."
〰〰〰〰〰〰
* فقط المالك وتعديل ويمكن أن تضيف السير في مجموعة
〰〰〰〰〰〰
* يمكن فقط للمشرفين ومالك استخدام ركلة، والحظر، رفع الحظر، newlink، وصلة، setphoto، setname، وقفل، وفتح، القواعد المنصوص، تعيين حول وأوامر الضبط
〰〰〰〰〰〰
* يمكن فقط للمالك استخدام الدقة، setowner، وتعزيز، وتخفيض الأوامر تسجيل
  ]]
  end
end

return {
  description = "helpfe", 
  usage = "/helpar : helpyou",
  patterns = {
    "^[!/*#.i]helpar$"
  }, 
	run = run,
    privileged = true,
	pre_process = pre_process
}
